Catalogs/СотрудникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СотрудникиОрганизаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаНаРаботуВКомпанию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольненияИзКомпании</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаНаРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УинВЗупе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СтажерыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтажерыПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСтажировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецСтажировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Comment>1 - пройдена, 2 - не пройдена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СотрудникиОрганизаций/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СинхронизироватьСЗУП(Команда)
	
	СинхронизироватьСЗУПСервер();
	
	////+++ АК gusd (ИП-00013992)
	//
	//// Установим/Снимем флаг Активный у физ. лиц
	//ТаблицаИзменений = ПолучитьТаблицуИзмененийАктивностиФизЛицНаСервере();
	//
	//Если ТаблицаИзменений.Количество() > 0 Тогда
	//	
	//	Состояние("Выполняется снятие флага активности у физических лиц...");
	//	
	//	ОбработатьТаблицуИзмененийНаСервере(ТаблицаИзменений);
	//	
	//	// отказались от открытия формы
	//	
	//	//ПараметрыОткрытия = Новый Структура;
	//	//ПараметрыОткрытия.Вставить("Состав", ТаблицаИзменений);
	//	//
	//	//ОткрытьФорму("Справочник.СотрудникиОрганизаций.Форма.ФормаИзмененияАктивностиФизЛиц", ПараметрыОткрытия, ЭтаФорма);
	//	
	//КонецЕсли;
	//
	////--- АК gusd (ИП-00013992)
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьСЗУПСервер()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОСотрудниках();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуИзмененийАктивностиФизЛицНаСервере()
	
	Возврат Справочники.СотрудникиОрганизаций.ПолучитьТаблицуИзмененийАктивностиФизЛиц();
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьТаблицуИзмененийНаСервере(ТаблицаИзменений)
	
	Для Каждого Стр Из ТаблицаИзменений Цикл
		
		ФЛОбъект = Стр.ФизЛицо.ПолучитьОбъект();
		ФЛОбъект.Активный = Стр.Активный;
		
		Попытка
			ФЛОбъект.Записать();
		Исключение
			Сообщить("Не удалось изменить флаг ""Ативный"" у физического лица " + Строка(ФЛОбъект));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

//+++АК POZM 2018.04.26 ИП-00018136
&НаКлиенте
Процедура Стажёры(Команда)
	Физик = Элементы.Список.ТекущаяСтрока.ФизЛицо;
	ОткрытьФорму("РегистрСведений.СтажерыПредприятия.ФормаСписка",Новый Структура("Отбор",Новый Структура("Наставник",Физик)));
КонецПроцедуры
//---АК POZM
